runs/run/fio/azure-2-nodes-32-cores/H16r_azure_files/2018-02-26_11:14:41/out.log
pwd = /home/ismagilov/hpchub_benchmark/tests/fio/fio-3.3
mpirun -env I_MPI_FABRICS=shm:dapl -env I_MPI_DAPL_PROVIDER=ofa-v2-ib0 -env I_MPI_DYNAMIC_CONNECTION=0 -env I_MPI_PIN_PROCESSOR_LIST=allcores:map=scatter --hostfile machinefile -n 32 -ppn 16 /home/ismagilov/nfs/fio-3.3/fiorun.sh randread 128m
getbw.value: 603
getlat.value: 7543.365
log-128m-randread-job.HPCHUB-CENTOS-H-1: 
box.HPCHUB-CENTOS-H-1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-1: (groupid=0, jobs=1): err= 0: pid=10859: Mon Feb 26 08:18:40 2018
   read: IOPS=203, BW=812KiB/s (832kB/s)(128MiB/161416msec)
    clat (usec): min=1765, max=207386, avg=4923.92, stdev=7106.99
     lat (usec): min=1765, max=207386, avg=4924.12, stdev=7106.99
    clat percentiles (usec):
     |  1.00th=[  1991],  5.00th=[  2147], 10.00th=[  2278], 20.00th=[  2474],
     | 30.00th=[  2671], 40.00th=[  2835], 50.00th=[  3032], 60.00th=[  3294],
     | 70.00th=[  3654], 80.00th=[  4146], 90.00th=[  7308], 95.00th=[ 17171],
     | 99.00th=[ 38536], 99.50th=[ 50070], 99.90th=[ 70779], 99.95th=[ 86508],
     | 99.99th=[135267]
   bw (  KiB/s): min=  127, max= 1325, per=99.90%, avg=811.15, stdev=206.08, samples=322
   iops        : min=   31, max=  331, avg=202.75, stdev=51.55, samples=322
  lat (msec)   : 2=1.14%, 4=76.37%, 10=13.93%, 20=4.75%, 50=3.31%
  lat (msec)   : 100=0.48%, 250=0.02%
  cpu          : usr=0.04%, sys=0.34%, ctx=32772, majf=0, minf=31
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=812KiB/s (832kB/s), 812KiB/s-812KiB/s (832kB/s-832kB/s), io=128MiB (134MB), run=161416-161416msec
log-128m-randread-job.HPCHUB-CENTOS-H-2: 
box.HPCHUB-CENTOS-H-2: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-2: (groupid=0, jobs=1): err= 0: pid=2441: Mon Feb 26 08:21:32 2018
   read: IOPS=98, BW=394KiB/s (403kB/s)(128MiB/333083msec)
    clat (usec): min=1844, max=495061, avg=10162.37, stdev=13837.37
     lat (usec): min=1845, max=495061, avg=10162.61, stdev=13837.37
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    4], 50.00th=[    5], 60.00th=[    8],
     | 70.00th=[   11], 80.00th=[   15], 90.00th=[   25], 95.00th=[   35],
     | 99.00th=[   66], 99.50th=[   79], 99.90th=[  112], 99.95th=[  128],
     | 99.99th=[  388]
   bw (  KiB/s): min=    8, max= 1424, per=100.00%, avg=393.21, stdev=175.81, samples=666
   iops        : min=    2, max=  356, avg=98.26, stdev=43.96, samples=666
  lat (msec)   : 2=0.44%, 4=48.45%, 10=18.64%, 20=18.81%, 50=11.51%
  lat (msec)   : 100=1.98%, 250=0.16%, 500=0.01%
  cpu          : usr=0.00%, sys=0.17%, ctx=32773, majf=0, minf=32
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=394KiB/s (403kB/s), 394KiB/s-394KiB/s (403kB/s-403kB/s), io=128MiB (134MB), run=333083-333083msec
rm: невозможно удалить «job*»: Нет такого файла или каталога
mpirun -env I_MPI_FABRICS=shm:dapl -env I_MPI_DAPL_PROVIDER=ofa-v2-ib0 -env I_MPI_DYNAMIC_CONNECTION=0 -env I_MPI_PIN_PROCESSOR_LIST=allcores:map=scatter --hostfile machinefile -n 32 -ppn 16 /home/ismagilov/nfs/fio-3.3/fiorun.sh randwrite 128m
getbw.value: 1286.5
getlat.value: 2093.22
log-128m-randwrite-job.HPCHUB-CENTOS-H-1: 
box.HPCHUB-CENTOS-H-1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-1: (groupid=0, jobs=1): err= 0: pid=11004: Mon Feb 26 08:21:34 2018
  write: IOPS=324k, BW=1267MiB/s (1329MB/s)(128MiB/101msec)
    clat (nsec): min=1700, max=74000, avg=1955.83, stdev=807.55
     lat (nsec): min=1800, max=74100, avg=2084.12, stdev=817.84
    clat percentiles (nsec):
     |  1.00th=[ 1704],  5.00th=[ 1704], 10.00th=[ 1800], 20.00th=[ 1800],
     | 30.00th=[ 1800], 40.00th=[ 1800], 50.00th=[ 1800], 60.00th=[ 1800],
     | 70.00th=[ 1896], 80.00th=[ 1896], 90.00th=[ 2288], 95.00th=[ 2416],
     | 99.00th=[ 4320], 99.50th=[ 4704], 99.90th=[ 9152], 99.95th=[11456],
     | 99.99th=[28544]
  lat (usec)   : 2=83.75%, 4=14.59%, 10=1.58%, 20=0.06%, 50=0.02%
  lat (usec)   : 100=0.01%
  cpu          : usr=10.00%, sys=75.00%, ctx=11, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1267MiB/s (1329MB/s), 1267MiB/s-1267MiB/s (1329MB/s-1329MB/s), io=128MiB (134MB), run=101-101msec
log-128m-randwrite-job.HPCHUB-CENTOS-H-2: 
box.HPCHUB-CENTOS-H-2: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-2: (groupid=0, jobs=1): err= 0: pid=2532: Mon Feb 26 08:21:34 2018
  write: IOPS=334k, BW=1306MiB/s (1370MB/s)(128MiB/98msec)
    clat (nsec): min=1700, max=37900, avg=1972.20, stdev=711.83
     lat (nsec): min=1800, max=38100, avg=2102.32, stdev=715.19
    clat percentiles (nsec):
     |  1.00th=[ 1704],  5.00th=[ 1800], 10.00th=[ 1800], 20.00th=[ 1800],
     | 30.00th=[ 1800], 40.00th=[ 1800], 50.00th=[ 1800], 60.00th=[ 1800],
     | 70.00th=[ 1896], 80.00th=[ 1896], 90.00th=[ 2288], 95.00th=[ 2416],
     | 99.00th=[ 4384], 99.50th=[ 4704], 99.90th=[10432], 99.95th=[12608],
     | 99.99th=[28032]
  lat (usec)   : 2=83.70%, 4=14.41%, 10=1.77%, 20=0.10%, 50=0.02%
  cpu          : usr=15.46%, sys=73.20%, ctx=12, majf=0, minf=30
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1306MiB/s (1370MB/s), 1306MiB/s-1306MiB/s (1370MB/s-1370MB/s), io=128MiB (134MB), run=98-98msec
rm: невозможно удалить «job*»: Нет такого файла или каталога
mpirun -env I_MPI_FABRICS=shm:dapl -env I_MPI_DAPL_PROVIDER=ofa-v2-ib0 -env I_MPI_DYNAMIC_CONNECTION=0 -env I_MPI_PIN_PROCESSOR_LIST=allcores:map=scatter --hostfile machinefile -n 32 -ppn 16 /home/ismagilov/nfs/fio-3.3/fiorun.sh read 128m
getbw.value: 79.9
getlat.value: 48542.435
log-128m-read-job.HPCHUB-CENTOS-H-1: 
box.HPCHUB-CENTOS-H-1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-1: (groupid=0, jobs=1): err= 0: pid=11105: Mon Feb 26 08:21:37 2018
   read: IOPS=18.0k, BW=74.2MiB/s (77.8MB/s)(128MiB/1726msec)
    clat (nsec): min=400, max=112825k, avg=51944.37, stdev=1330611.06
     lat (nsec): min=500, max=112825k, avg=52065.23, stdev=1330611.14
    clat percentiles (nsec):
     |  1.00th=[     502],  5.00th=[     604], 10.00th=[     604],
     | 20.00th=[     604], 30.00th=[     700], 40.00th=[     700],
     | 50.00th=[     700], 60.00th=[     700], 70.00th=[     700],
     | 80.00th=[     804], 90.00th=[     804], 95.00th=[     804],
     | 99.00th=[     900], 99.50th=[    1400], 99.90th=[18481152],
     | 99.95th=[22675456], 99.99th=[47448064]
   bw (  KiB/s): min=73580, max=83616, per=100.00%, avg=77657.33, stdev=5275.88, samples=3
   iops        : min=18395, max=20904, avg=19414.33, stdev=1318.97, samples=3
  lat (nsec)   : 500=0.12%, 750=74.67%, 1000=24.25%
  lat (usec)   : 2=0.54%, 4=0.02%, 10=0.05%, 20=0.03%, 50=0.01%
  lat (usec)   : 250=0.03%
  lat (msec)   : 2=0.01%, 4=0.05%, 10=0.03%, 20=0.12%, 50=0.07%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.70%, sys=6.03%, ctx=144, majf=0, minf=31
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=74.2MiB/s (77.8MB/s), 74.2MiB/s-74.2MiB/s (77.8MB/s-77.8MB/s), io=128MiB (134MB), run=1726-1726msec
log-128m-read-job.HPCHUB-CENTOS-H-2: 
box.HPCHUB-CENTOS-H-2: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-2: (groupid=0, jobs=1): err= 0: pid=2627: Mon Feb 26 08:21:37 2018
   read: IOPS=21.9k, BW=85.6MiB/s (89.8MB/s)(128MiB/1495msec)
    clat (nsec): min=400, max=61170k, avg=44900.02, stdev=1017373.55
     lat (nsec): min=500, max=61170k, avg=45019.64, stdev=1017374.44
    clat percentiles (nsec):
     |  1.00th=[     502],  5.00th=[     502], 10.00th=[     604],
     | 20.00th=[     604], 30.00th=[     604], 40.00th=[     604],
     | 50.00th=[     700], 60.00th=[     700], 70.00th=[     700],
     | 80.00th=[     804], 90.00th=[     804], 95.00th=[     804],
     | 99.00th=[    1004], 99.50th=[    1896], 99.90th=[16056320],
     | 99.95th=[21889024], 99.99th=[45875200]
   bw (  KiB/s): min=75776, max=81568, per=89.73%, avg=78672.00, stdev=4095.56, samples=2
   iops        : min=18944, max=20392, avg=19668.00, stdev=1023.89, samples=2
  lat (nsec)   : 500=0.20%, 750=77.85%, 1000=20.84%
  lat (usec)   : 2=0.61%, 4=0.08%, 10=0.03%, 20=0.04%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.03%
  lat (msec)   : 4=0.03%, 10=0.11%, 20=0.10%, 50=0.06%, 100=0.01%
  cpu          : usr=0.54%, sys=5.82%, ctx=242, majf=0, minf=32
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=85.6MiB/s (89.8MB/s), 85.6MiB/s-85.6MiB/s (89.8MB/s-89.8MB/s), io=128MiB (134MB), run=1495-1495msec
rm: невозможно удалить «job*»: Нет такого файла или каталога
mpirun -env I_MPI_FABRICS=shm:dapl -env I_MPI_DAPL_PROVIDER=ofa-v2-ib0 -env I_MPI_DYNAMIC_CONNECTION=0 -env I_MPI_PIN_PROCESSOR_LIST=allcores:map=scatter --hostfile machinefile -n 32 -ppn 16 /home/ismagilov/nfs/fio-3.3/fiorun.sh write 128m
getbw.value: 1265
getlat.value: 2083.215
log-128m-write-job.HPCHUB-CENTOS-H-1: 
box.HPCHUB-CENTOS-H-1: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-1: (groupid=0, jobs=1): err= 0: pid=11199: Mon Feb 26 08:21:39 2018
  write: IOPS=287k, BW=1123MiB/s (1177MB/s)(128MiB/114msec)
    clat (nsec): min=1600, max=278600, avg=1953.12, stdev=1757.51
     lat (nsec): min=1800, max=278700, avg=2084.83, stdev=1762.82
    clat percentiles (nsec):
     |  1.00th=[ 1704],  5.00th=[ 1704], 10.00th=[ 1704], 20.00th=[ 1800],
     | 30.00th=[ 1800], 40.00th=[ 1800], 50.00th=[ 1800], 60.00th=[ 1800],
     | 70.00th=[ 1800], 80.00th=[ 1896], 90.00th=[ 2288], 95.00th=[ 2416],
     | 99.00th=[ 4512], 99.50th=[ 4896], 99.90th=[12864], 99.95th=[18816],
     | 99.99th=[33024]
  lat (usec)   : 2=85.58%, 4=12.31%, 10=1.91%, 20=0.16%, 50=0.04%
  lat (usec)   : 500=0.01%
  cpu          : usr=7.96%, sys=65.49%, ctx=12, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1123MiB/s (1177MB/s), 1123MiB/s-1123MiB/s (1177MB/s-1177MB/s), io=128MiB (134MB), run=114-114msec
log-128m-write-job.HPCHUB-CENTOS-H-2: 
box.HPCHUB-CENTOS-H-2: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-2: (groupid=0, jobs=1): err= 0: pid=2716: Mon Feb 26 08:21:40 2018
  write: IOPS=360k, BW=1407MiB/s (1475MB/s)(128MiB/91msec)
    clat (nsec): min=1600, max=52000, avg=1945.04, stdev=946.44
     lat (nsec): min=1800, max=151900, avg=2081.60, stdev=1290.32
    clat percentiles (nsec):
     |  1.00th=[ 1704],  5.00th=[ 1704], 10.00th=[ 1704], 20.00th=[ 1704],
     | 30.00th=[ 1800], 40.00th=[ 1800], 50.00th=[ 1800], 60.00th=[ 1800],
     | 70.00th=[ 1800], 80.00th=[ 1896], 90.00th=[ 2288], 95.00th=[ 2416],
     | 99.00th=[ 4384], 99.50th=[ 4896], 99.90th=[12864], 99.95th=[19584],
     | 99.99th=[39680]
  lat (usec)   : 2=85.48%, 4=12.65%, 10=1.69%, 20=0.14%, 50=0.04%
  lat (usec)   : 100=0.01%
  cpu          : usr=10.00%, sys=82.22%, ctx=10, majf=0, minf=30
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1407MiB/s (1475MB/s), 1407MiB/s-1407MiB/s (1475MB/s-1475MB/s), io=128MiB (134MB), run=91-91msec
rm: невозможно удалить «job*»: Нет такого файла или каталога
mpirun -env I_MPI_FABRICS=shm:dapl -env I_MPI_DAPL_PROVIDER=ofa-v2-ib0 -env I_MPI_DYNAMIC_CONNECTION=0 -env I_MPI_PIN_PROCESSOR_LIST=allcores:map=scatter --hostfile machinefile -n 32 -ppn 16 /home/ismagilov/nfs/fio-3.3/fiorun.sh randread 1024m
getbw.value: 180.5
getlat.value: 10550.185
log-1024m-randread-job.HPCHUB-CENTOS-H-1: 
box.HPCHUB-CENTOS-H-1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-1: (groupid=0, jobs=1): err= 0: pid=11304: Mon Feb 26 10:03:41 2018
   read: IOPS=42, BW=171KiB/s (175kB/s)(1024MiB/6121198msec)
    clat (msec): min=2, max=869, avg=23.35, stdev=21.11
     lat (msec): min=2, max=869, avg=23.35, stdev=21.11
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    4], 20.00th=[    9],
     | 30.00th=[   14], 40.00th=[   17], 50.00th=[   20], 60.00th=[   22],
     | 70.00th=[   26], 80.00th=[   32], 90.00th=[   46], 95.00th=[   63],
     | 99.00th=[  106], 99.50th=[  121], 99.90th=[  169], 99.95th=[  199],
     | 99.99th=[  326]
   bw (  KiB/s): min=    8, max=  800, per=100.00%, avg=171.30, stdev=58.16, samples=12239
   iops        : min=    2, max=  200, avg=42.77, stdev=14.54, samples=12239
  lat (msec)   : 4=12.30%, 10=8.96%, 20=32.51%, 50=37.91%, 100=7.07%
  lat (msec)   : 250=1.24%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=0.01%, sys=0.08%, ctx=262148, majf=0, minf=69
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=171KiB/s (175kB/s), 171KiB/s-171KiB/s (175kB/s-175kB/s), io=1024MiB (1074MB), run=6121198-6121198msec
log-1024m-randread-job.HPCHUB-CENTOS-H-2: 
box.HPCHUB-CENTOS-H-2: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process
box.HPCHUB-CENTOS-H-2: Laying out IO file (1 file / 1024MiB)

box.HPCHUB-CENTOS-H-2: (groupid=0, jobs=1): err= 0: pid=2810: Mon Feb 26 09:54:14 2018
   read: IOPS=47, BW=190KiB/s (194kB/s)(1024MiB/5525760msec)
    clat (usec): min=1954, max=1177.3k, avg=21076.76, stdev=19610.28
     lat (usec): min=1955, max=1177.3k, avg=21077.02, stdev=19610.28
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    4], 20.00th=[   11],
     | 30.00th=[   13], 40.00th=[   15], 50.00th=[   17], 60.00th=[   20],
     | 70.00th=[   23], 80.00th=[   29], 90.00th=[   41], 95.00th=[   56],
     | 99.00th=[   92], 99.50th=[  107], 99.90th=[  155], 99.95th=[  199],
     | 99.99th=[  550]
   bw (  KiB/s): min=    7, max= 1048, per=100.00%, avg=189.94, stdev=70.79, samples=11038
   iops        : min=    1, max=  262, avg=47.42, stdev=17.70, samples=11038
  lat (msec)   : 2=0.01%, 4=11.55%, 10=8.47%, 20=43.40%, 50=30.25%
  lat (msec)   : 100=5.61%, 250=0.69%, 500=0.02%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.01%, sys=0.09%, ctx=262149, majf=0, minf=89
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=190KiB/s (194kB/s), 190KiB/s-190KiB/s (194kB/s-194kB/s), io=1024MiB (1074MB), run=5525760-5525760msec
rm: невозможно удалить «job*»: Нет такого файла или каталога
mpirun -env I_MPI_FABRICS=shm:dapl -env I_MPI_DAPL_PROVIDER=ofa-v2-ib0 -env I_MPI_DYNAMIC_CONNECTION=0 -env I_MPI_PIN_PROCESSOR_LIST=allcores:map=scatter --hostfile machinefile -n 32 -ppn 16 /home/ismagilov/nfs/fio-3.3/fiorun.sh randwrite 1024m
getbw.value: 1378.5
getlat.value: 2189.93
log-1024m-randwrite-job.HPCHUB-CENTOS-H-1: 
box.HPCHUB-CENTOS-H-1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-1: (groupid=0, jobs=1): err= 0: pid=11607: Mon Feb 26 10:03:56 2018
  write: IOPS=349k, BW=1364MiB/s (1430MB/s)(1024MiB/751msec)
    clat (nsec): min=1700, max=540100, avg=2054.94, stdev=1777.70
     lat (nsec): min=1800, max=540200, avg=2183.26, stdev=1790.52
    clat percentiles (nsec):
     |  1.00th=[ 1704],  5.00th=[ 1800], 10.00th=[ 1800], 20.00th=[ 1800],
     | 30.00th=[ 1800], 40.00th=[ 1896], 50.00th=[ 1896], 60.00th=[ 1896],
     | 70.00th=[ 2008], 80.00th=[ 2008], 90.00th=[ 2416], 95.00th=[ 2608],
     | 99.00th=[ 4512], 99.50th=[ 4896], 99.90th=[ 9408], 99.95th=[13248],
     | 99.99th=[39168]
   bw (  MiB/s): min= 1330, max= 1330, per=97.60%, avg=1330.81, stdev= 0.00, samples=1
   iops        : min=340686, max=340686, avg=340686.00, stdev= 0.00, samples=1
  lat (usec)   : 2=63.82%, 4=34.02%, 10=2.07%, 20=0.05%, 50=0.03%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=14.53%, sys=80.40%, ctx=69, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1364MiB/s (1430MB/s), 1364MiB/s-1364MiB/s (1430MB/s-1430MB/s), io=1024MiB (1074MB), run=751-751msec
log-1024m-randwrite-job.HPCHUB-CENTOS-H-2: 
box.HPCHUB-CENTOS-H-2: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-2: (groupid=0, jobs=1): err= 0: pid=4127: Mon Feb 26 10:03:57 2018
  write: IOPS=357k, BW=1393MiB/s (1461MB/s)(1024MiB/735msec)
    clat (nsec): min=1700, max=2634.1k, avg=2064.91, stdev=5340.59
     lat (nsec): min=1800, max=2634.3k, avg=2196.60, stdev=5348.28
    clat percentiles (nsec):
     |  1.00th=[ 1704],  5.00th=[ 1800], 10.00th=[ 1800], 20.00th=[ 1800],
     | 30.00th=[ 1800], 40.00th=[ 1896], 50.00th=[ 1896], 60.00th=[ 1896],
     | 70.00th=[ 2008], 80.00th=[ 2008], 90.00th=[ 2416], 95.00th=[ 2608],
     | 99.00th=[ 4512], 99.50th=[ 4896], 99.90th=[10304], 99.95th=[18304],
     | 99.99th=[42240]
   bw (  MiB/s): min= 1377, max= 1377, per=98.84%, avg=1377.09, stdev= 0.00, samples=1
   iops        : min=352536, max=352536, avg=352536.00, stdev= 0.00, samples=1
  lat (usec)   : 2=63.56%, 4=34.26%, 10=2.08%, 20=0.06%, 50=0.04%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 4=0.01%
  cpu          : usr=16.21%, sys=81.47%, ctx=68, majf=0, minf=31
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1393MiB/s (1461MB/s), 1393MiB/s-1393MiB/s (1461MB/s-1461MB/s), io=1024MiB (1074MB), run=735-735msec
rm: невозможно удалить «job*»: Нет такого файла или каталога
mpirun -env I_MPI_FABRICS=shm:dapl -env I_MPI_DAPL_PROVIDER=ofa-v2-ib0 -env I_MPI_DYNAMIC_CONNECTION=0 -env I_MPI_PIN_PROCESSOR_LIST=allcores:map=scatter --hostfile machinefile -n 32 -ppn 16 /home/ismagilov/nfs/fio-3.3/fiorun.sh read 1024m
getbw.value: 93.6
getlat.value: 41241.09
log-1024m-read-job.HPCHUB-CENTOS-H-1: 
box.HPCHUB-CENTOS-H-1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-1: (groupid=0, jobs=1): err= 0: pid=11705: Mon Feb 26 10:04:09 2018
   read: IOPS=24.4k, BW=95.3MiB/s (99.0MB/s)(1024MiB/10740msec)
    clat (nsec): min=400, max=618789k, avg=40344.83, stdev=1660708.02
     lat (nsec): min=500, max=618789k, avg=40459.89, stdev=1660708.03
    clat percentiles (nsec):
     |  1.00th=[     502],  5.00th=[     604], 10.00th=[     604],
     | 20.00th=[     700], 30.00th=[     700], 40.00th=[     700],
     | 50.00th=[     700], 60.00th=[     700], 70.00th=[     700],
     | 80.00th=[     804], 90.00th=[     804], 95.00th=[     804],
     | 99.00th=[    1004], 99.50th=[    1496], 99.90th=[10420224],
     | 99.95th=[16711680], 99.99th=[38535168]
   bw (  KiB/s): min= 2048, max=135168, per=99.67%, avg=97307.48, stdev=36994.98, samples=21
   iops        : min=  512, max=33792, avg=24326.86, stdev=9248.76, samples=21
  lat (nsec)   : 500=0.32%, 750=71.34%, 1000=27.33%
  lat (usec)   : 2=0.55%, 4=0.03%, 10=0.04%, 20=0.02%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.22%, 20=0.07%, 50=0.03%
  lat (msec)   : 100=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.81%, sys=4.07%, ctx=1419, majf=0, minf=31
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=95.3MiB/s (99.0MB/s), 95.3MiB/s-95.3MiB/s (99.0MB/s-99.0MB/s), io=1024MiB (1074MB), run=10740-10740msec
log-1024m-read-job.HPCHUB-CENTOS-H-2: 
box.HPCHUB-CENTOS-H-2: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-2: (groupid=0, jobs=1): err= 0: pid=4247: Mon Feb 26 10:04:10 2018
   read: IOPS=23.5k, BW=91.9MiB/s (96.4MB/s)(1024MiB/11144msec)
    clat (nsec): min=400, max=973743k, avg=41903.03, stdev=2090786.36
     lat (nsec): min=500, max=973743k, avg=42022.29, stdev=2090786.42
    clat percentiles (nsec):
     |  1.00th=[     502],  5.00th=[     502], 10.00th=[     502],
     | 20.00th=[     502], 30.00th=[     604], 40.00th=[     604],
     | 50.00th=[     604], 60.00th=[     604], 70.00th=[     604],
     | 80.00th=[     604], 90.00th=[     700], 95.00th=[     700],
     | 99.00th=[     900], 99.50th=[    1608], 99.90th=[ 8454144],
     | 99.95th=[14614528], 99.99th=[42729472]
   bw (  KiB/s): min=28672, max=133120, per=100.00%, avg=98659.95, stdev=27678.56, samples=21
   iops        : min= 7168, max=33280, avg=24664.95, stdev=6919.64, samples=21
  lat (nsec)   : 500=0.25%, 750=95.38%, 1000=3.50%
  lat (usec)   : 2=0.40%, 4=0.04%, 10=0.04%, 20=0.02%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%
  lat (msec)   : 4=0.01%, 10=0.27%, 20=0.05%, 50=0.02%, 100=0.01%
  lat (msec)   : 1000=0.01%
  cpu          : usr=0.81%, sys=2.96%, ctx=1095, majf=0, minf=32
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=91.9MiB/s (96.4MB/s), 91.9MiB/s-91.9MiB/s (96.4MB/s-96.4MB/s), io=1024MiB (1074MB), run=11144-11144msec
rm: невозможно удалить «job*»: Нет такого файла или каталога
mpirun -env I_MPI_FABRICS=shm:dapl -env I_MPI_DAPL_PROVIDER=ofa-v2-ib0 -env I_MPI_DYNAMIC_CONNECTION=0 -env I_MPI_PIN_PROCESSOR_LIST=allcores:map=scatter --hostfile machinefile -n 32 -ppn 16 /home/ismagilov/nfs/fio-3.3/fiorun.sh write 1024m
getbw.value: 1500
getlat.value: 2095.43
log-1024m-write-job.HPCHUB-CENTOS-H-1: 
box.HPCHUB-CENTOS-H-1: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-1: (groupid=0, jobs=1): err= 0: pid=11810: Mon Feb 26 10:04:20 2018
  write: IOPS=392k, BW=1531MiB/s (1605MB/s)(1024MiB/669msec)
    clat (nsec): min=1600, max=252600, avg=1928.75, stdev=1008.98
     lat (nsec): min=1800, max=252700, avg=2056.21, stdev=1025.53
    clat percentiles (nsec):
     |  1.00th=[ 1704],  5.00th=[ 1704], 10.00th=[ 1704], 20.00th=[ 1704],
     | 30.00th=[ 1800], 40.00th=[ 1800], 50.00th=[ 1800], 60.00th=[ 1800],
     | 70.00th=[ 1800], 80.00th=[ 1800], 90.00th=[ 2288], 95.00th=[ 2416],
     | 99.00th=[ 4384], 99.50th=[ 4704], 99.90th=[ 8512], 99.95th=[11712],
     | 99.99th=[38656]
   bw (  MiB/s): min= 1527, max= 1527, per=99.77%, avg=1527.16, stdev= 0.00, samples=1
   iops        : min=390952, max=390952, avg=390952.00, stdev= 0.00, samples=1
  lat (usec)   : 2=85.97%, 4=12.08%, 10=1.89%, 20=0.03%, 50=0.03%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=14.37%, sys=84.58%, ctx=64, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1531MiB/s (1605MB/s), 1531MiB/s-1531MiB/s (1605MB/s-1605MB/s), io=1024MiB (1074MB), run=669-669msec
log-1024m-write-job.HPCHUB-CENTOS-H-2: 
box.HPCHUB-CENTOS-H-2: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.HPCHUB-CENTOS-H-2: (groupid=0, jobs=1): err= 0: pid=4341: Mon Feb 26 10:04:21 2018
  write: IOPS=376k, BW=1469MiB/s (1541MB/s)(1024MiB/697msec)
    clat (nsec): min=1600, max=1616.0k, avg=2000.77, stdev=3651.56
     lat (nsec): min=1800, max=1616.1k, avg=2134.65, stdev=3681.94
    clat percentiles (nsec):
     |  1.00th=[ 1704],  5.00th=[ 1704], 10.00th=[ 1704], 20.00th=[ 1800],
     | 30.00th=[ 1800], 40.00th=[ 1800], 50.00th=[ 1800], 60.00th=[ 1800],
     | 70.00th=[ 1800], 80.00th=[ 1896], 90.00th=[ 2288], 95.00th=[ 2416],
     | 99.00th=[ 4512], 99.50th=[ 4896], 99.90th=[43264], 99.95th=[47360],
     | 99.99th=[66048]
   bw (  MiB/s): min= 1463, max= 1463, per=99.63%, avg=1463.71, stdev= 0.00, samples=1
   iops        : min=374709, max=374709, avg=374709.00, stdev= 0.00, samples=1
  lat (usec)   : 2=86.74%, 4=11.19%, 10=1.83%, 20=0.10%, 50=0.10%
  lat (usec)   : 100=0.03%, 250=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=15.23%, sys=83.62%, ctx=66, majf=0, minf=31
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1469MiB/s (1541MB/s), 1469MiB/s-1469MiB/s (1541MB/s-1541MB/s), io=1024MiB (1074MB), run=697-697msec